     A*============================================================
     A* PLATSCI OUTBOUND FREEFORM MESSAGE FILE
     A*============================================================
     A          R PSOBFFMSGR                PFILE(PSOBFFMSGP)
     A          K PSMSG#
     A          S PSSNDQ                    COMP(EQ ' ')
     A            PSMTYP                    COMP(EQ 'HI')
     A          O                           ALL
