     pgm
     DCL        VAR(&TIMESTAMP) TYPE(*CHAR) LEN(20)
     DCL        VAR(&NEWNAME) TYPE(*CHAR) LEN(30)
     RTVSYSVAL  SYSVAL(QDATETIME) RTNVAR(&TIMESTAMP)
     CHGVAR     VAR(&NEWNAME) VALUE('app.log.' *CAT &TIMESTAMP)
     RNM        OBJ('/home/platsci01/logs/app.log') +
                  NEWOBJ(&NEWNAME)
             MONMSG     MSGID(CPFA0A9)

     RUNJVA CLASS('/home/platsci01/amqp-consumer-agent.jar') +
            PROP((logPath '/home/platsci01'))
     endpgm
