     A*============================================================
     A*============================================================
     A
     A
     A          R HTTPR
     A
     A            DEBUG        132          COLHDG('TEXT')
