     A*============================================================
     A* LIST OF ACTIVE DRIVERS TO PROCESS WF JOBS
     A*============================================================
     A
     A
     A          R PLACTDRVR
     A
     A            PLDRVCODE      6A         TEXT('Driver Code to get WF')
     A                                      COLHDG('Drvr Code to get WF')
     A          K PLDRVCODE
