             PGM

             DCL        VAR(&DAYS) TYPE(*DEC) LEN(3 0) VALUE(93)

             CALL       PGM(PLTPRGHBD) PARM(&DAYS) /* Purge records +
                          < 93 Days */

             RGZPFM     FILE(PLTMHBDP) RBDACCPTH(*NO) +
                          ALWCANCEL(*YES) LOCK(*SHRUPD) /* Reorg +
                          Heartbeats #1 */

             RGZPFM     FILE(PLTMHBDP) RBDACCPTH(*NO) +
                          ALWCANCEL(*YES) LOCK(*SHRUPD) +
                          FROMRCD(*PRVRGZ) /* Reorg Heartbeats #2 */

             ENDPGM
