             PGM        PARM(&HOURS)
             DCL        VAR(&OFFSET) TYPE(*char) LEN(5)
             DCL        VAR(&hours) TYPE(*char) LEN(2)
             RTVSYSVAL  SYSVAL(QUTCOFFSET) RTNVAR(&OFFSET)
             CHGVAR     VAR(&HOURS) VALUE(%SST(&offset 2 2))
             endpgm
